Repository: kddlb/aitranslate_lyrics_25
Catalog: lib/l10n/intl_*.arb
Languages: fr, it, ko_kr, pt, zh_cn

# firstStartNoAPIKeyDialogTitle
source: An OpenAI API key is required.
fr: Une clé API OpenAI est requise.
it: È richiesta una chiave API di OpenAI.
ko_kr: OpenAI API 키가 필요합니다.
pt: Uma chave da API OpenAI é necessária.
zh_cn: 需要OpenAI API密钥。

# firstStartNoAPiKeyDialogText
source: The API key is stored in your device and is sent directly to OpenAI.
fr: La clé API est stockée dans votre appareil et est envoyée directement à OpenAI.
it: La chiave API è memorizzata nel tuo dispositivo e viene inviata direttamente a OpenAI.
ko_kr: API 키는 기기에 저장되며 OpenAI로 직접 전송됩니다.
pt: A chave da API é armazenada em seu dispositivo e enviada diretamente para a OpenAI.
zh_cn: API密钥存储在您的设备上，并直接发送到OpenAI。

# firstStartNoAPIKeyDialogButtonGo
source: Go to the OpenAI dashboard
fr: Aller au tableau de bord OpenAI
it: Vai al dashboard di OpenAI
ko_kr: OpenAI 대시보드로 이동
pt: Ir para o painel da OpenAI
zh_cn: 前往OpenAI仪表板

# firstStartNoAPIKeyDialogButtonSet
source: Set
fr: Définir
it: Imposta
ko_kr: 설정
pt: Definir
zh_cn: 设置

# actionClear
source: Clear
fr: Effacer
it: Cancella
ko_kr: 지우기
pt: Limpar
zh_cn: 清除

# actionSwap
source: Swap languages
fr: Échanger les langues
it: Scambia lingue
ko_kr: 언어 전환
pt: Trocar idiomas
zh_cn: 切换语言

# actionSettings
source: Settings
fr: Paramètres
it: Impostazioni
ko_kr: 설정
pt: Configurações
zh_cn: 设置

# txSourceLanguage
source: Source language
fr: Langue source
it: Lingua di origine
ko_kr: 출발 언어
pt: Idioma de origem
zh_cn: 源语言

# txSourceLanguageHint
source: Keep empty to detect language
fr: Laisser vide pour détecter la langue
it: Lascia vuoto per rilevare la lingua
ko_kr: 언어 감지를 위해 비워두세요
pt: Deixe vazio para detectar o idioma
zh_cn: 保持为空以检测语言

# txSourceText
source: Lyrics to translate
fr: Paroles à traduire
it: Testo da tradurre
ko_kr: 번역할 가사
pt: Letras para traduzir
zh_cn: 要翻译的歌词

# txSourceTextValidationError
source: Please enter some text
fr: Veuillez entrer du texte
it: Per favore, inserisci del testo
ko_kr: 문자를 입력하세요
pt: Por favor, insira algum texto
zh_cn: 请输入一些文字

# txTargetLanguage
source: Language to translate to
fr: Langue de traduction
it: Lingua di destinazione
ko_kr: 번역할 언어
pt: Idioma para traduzir para
zh_cn: 翻译成的语言

# txTargetLanguageValidationError
source: Please enter a language
fr: Veuillez entrer une langue
it: Per favore, inserisci una lingua
ko_kr: 언어를 입력하세요
pt: Por favor, insira um idioma
zh_cn: 请输入一种语言

# errNoAPiKey
source: An API key is required.
fr: Une clé API est requise.
it: È richiesta una chiave API.
ko_kr: API 키가 필요합니다.
pt: Uma chave de API é necessária.
zh_cn: 需要API密钥。

# txFabTranslate
source: Translate
fr: Traduire
it: Traduci
ko_kr: 번역
pt: Traduzir
zh_cn: 翻译

# settingsAPIKey
source: API key
fr: Clé API
it: Chiave API
ko_kr: API 키
pt: Chave de API
zh_cn: API密钥

# settingsAPIKeyValidationError
source: API key is required.
fr: La clé API est requise.
it: È richiesta una chiave API.
ko_kr: API 키가 필요합니다.
pt: A chave de API é necessária.
zh_cn: 需要API密钥。

# settingsModel
source: Model
fr: Modèle
it: Modello
ko_kr: 모델
pt: Modelo
zh_cn: 模型

# settingsAutoScroll
source: Auto-scroll on translate
fr: Défilement automatique à la traduction
it: Scorrimento automatico alla traduzione
ko_kr: 번역 시 자동 스크롤
pt: Rolar automaticamente ao traduzir
zh_cn: 翻译时自动滚动

# errLength
source: Translation is too long
fr: La traduction est trop longue
it: La traduzione è troppo lunga
ko_kr: 번역이 너무 깁니다
pt: A tradução é muito longa
zh_cn: 翻译太长

# errContentFilter
source: Translation contains inappropriate content, according to OpenAI's content filter
fr: La traduction contient un contenu inapproprié, selon le filtre de contenu d'OpenAI
it: La traduzione contiene contenuto inappropriato, secondo il filtro dei contenuti di OpenAI
ko_kr: OpenAI의 콘텐츠 필터에 따르면 번역에 부적절한 콘텐츠가 포함되어 있습니다
pt: A tradução contém conteúdo inadequado, de acordo com o filtro de conteúdo da OpenAI
zh_cn: 根据OpenAI的内容过滤器，翻译包含不当内容

# translationTitle
source: Translation
fr: Traduction
it: Traduzione
ko_kr: 번역
pt: Tradução
zh_cn: 翻译
